In [1]:
import pandas as pd

In [5]:
col_names = ['User_ID', 'Age', 'Gender','Occupation', 'Zip_Code' ]
users = pd.read_table('http://bit.ly/movieusers', sep='|', header=None, names=col_names, index_col='User_ID')

In [6]:
users.head()

         Age Gender  Occupation Zip_Code
User_ID
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [10]:
users.shape

(943, 4)

In [11]:
# the duplicated() method returns a True value if there is an entry entered previous to it
users.Zip_Code.duplicated()

User_ID
1      False
2      False
3      False
4      False
5      False
       ...
939    False
940     True
941    False
942    False
943    False
Name: Zip_Code, Length: 943, dtype: bool

In [13]:
users.Zip_Code.duplicated().sum()

148

In [14]:
# based on True value in previous duplicated(0 method, this displays duplicated rows
users[users.Zip_Code.duplicated()]

         Age Gender     Occupation Zip_Code
User_ID
29        41      M     programmer    94043
52        18      F        student    55105
56        25      M      librarian    46260
84        32      M      executive    55369
92        32      M  entertainment    80525
...      ...    ...            ...      ...
928       21      M        student    55408
929       44      M      scientist    53711
934       61      M       engineer    22902
937       48      M       educator    98072
940       32      M  administrator    02215

[148 rows x 4 columns]

In [15]:
# count entire duplicated rows 
users.duplicated().sum()

7

In [16]:
users[users.duplicated()]

         Age Gender Occupation Zip_Code
User_ID
496       21      F    student    55414
572       51      M   educator    20003
621       17      M    student    60402
684       28      M    student    55414
733       44      F      other    60630
805       27      F      other    20009
890       32      M    student    97301

In [18]:
users.loc[users.duplicated(keep='first'),:]

         Age Gender Occupation Zip_Code
User_ID
496       21      F    student    55414
572       51      M   educator    20003
621       17      M    student    60402
684       28      M    student    55414
733       44      F      other    60630
805       27      F      other    20009
890       32      M    student    97301

In [19]:
users.loc[users.duplicated(keep='last'),:]

         Age Gender Occupation Zip_Code
User_ID
67        17      M    student    60402
85        51      M   educator    20003
198       21      F    student    55414
350       32      M    student    97301
428       28      M    student    55414
437       27      F      other    20009
460       44      F      other    60630

In [20]:
users.loc[users.duplicated(keep=False),:]

         Age Gender Occupation Zip_Code
User_ID
67        17      M    student    60402
85        51      M   educator    20003
198       21      F    student    55414
350       32      M    student    97301
428       28      M    student    55414
437       27      F      other    20009
460       44      F      other    60630
496       21      F    student    55414
572       51      M   educator    20003
621       17      M    student    60402
684       28      M    student    55414
733       44      F      other    60630
805       27      F      other    20009
890       32      M    student    97301

In [22]:
# drop duplicated rows from DataFrame
users.drop_duplicates(keep='first').shape

(936, 4)

In [31]:
# only consider 'Age' and 'Zip_Code' as the relevant columns to identify duplicates
users.duplicated(subset=['Age', 'Zip_Code']).sum()

16

In [32]:
users.drop_duplicates(subset=['Age', 'Zip_Code']).shape

(927, 4)